In [1]:
# Importing packages
import pandas as pd
import numpy as np

df = pd.DataFrame([('bird', 'Falconiformes', 389.0),
        ('bird', 'Psittaciformes', 24.0),
        ('mammal', 'Carnivora', 80.2),
        ('mammal', 'Primates', np.nan),
        ('mammal', 'Carnivora', 58)],
        index=['falcon', 'parrot', 'lion', 'monkey', 'leopard'], columns=('class', 'order', 'max_speed'))

df

# default is axis=0

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [2]:
df.groupby('class')

df

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [3]:
grouped = df.groupby('class')

df

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [4]:
df.groupby(['class', 'order'])

df

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [5]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                        'B': ['one', 'one', 'two', 'three',
                        'two', 'two', 'one', 'three'],
                        'C': np.random.randn(8),
                        'D': np.random.randn(8)})

In [6]:
df

     A      B         C         D
0  foo    one -0.457430  0.481945
1  bar    one -1.088250 -0.252170
2  foo    two -0.567594  0.220479
3  bar  three  0.853457 -0.631546
4  foo    two  1.981484 -0.180517
5  bar    two -0.772712 -1.112503
6  foo    one -1.187182 -0.021224
7  foo  three -0.144611  1.113613

In [7]:
grouped = df.groupby('A')

In [9]:
print(grouped);

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x114958d50>

In [10]:
grouped = df.groupby(['A', 'B'])

In [11]:
grouped